In [25]:
# Objetivos do projeto
# 1 - Visualizar os top 10 masculino e feminino com filtro por categoria
# 2 - Analisar qual modalidade esportiva fez mais diferença no resultado final
# 3 - Calcular o desempenho com base na faixa etária
# 4 - Comparar resultados entre atletas( separados por modalidade)
# 5 - Calcular o impacto das transições no resultado final
# 6 - Comparação entre países
# 7 - Analisar atletas que não completaram ou foram desqualificados

In [26]:
import pandas as pd

In [27]:
data = pd.read_csv('results.csv')
data.head()

,BIB,Name,Country,Gender,Division,Swim,Bike,Run,Overall,Division Rank,Gender Rank,Overall Rank,T1,T2
0,4,"Frodeno, Jan",DEU,Male,MPRO,00:47:31,04:16:02,02:42:43,07:51:13,1,1,1,00:01:58,00:02:59
1,6,"O'donnell, Tim",USA,Male,MPRO,00:47:38,04:18:11,02:49:45,07:59:41,2,2,2,00:02:01,00:02:06
2,5,"Kienle, Sebastian",DEU,Male,MPRO,00:52:17,04:15:04,02:49:56,08:02:04,3,3,3,00:02:12,00:02:35
3,14,"Hoffman, Ben",USA,Male,MPRO,00:51:01,04:24:01,02:43:08,08:02:52,4,4,4,00:02:25,00:02:17
4,11,"Wurf, Cameron",AUS,Male,MPRO,00:52:25,04:14:44,02:55:03,08:06:41,5,5,5,00:02:07,00:02:22

In [28]:
data.shape

(2434, 14)

In [29]:
def strToSeconds(val):
    if ':' in str(val):
        h, m, s = val.split(':')
        return int(int(h) * 3600 + int(m) * 60 + int(s))
    else:
        return str(val)

In [30]:
print(strToSeconds('08:06:41'))
print(strToSeconds('00:52:17'))
print(strToSeconds('DNS'))
print(strToSeconds('DNF'))
print(strToSeconds(''))

29201
3137
DNS
DNF

In [31]:
data = pd.DataFrame(data)

In [32]:
data['Swim_s'] = data['Swim'].apply(strToSeconds)
data['Bike_s'] = data['Bike'].apply(strToSeconds)
data['Run_s'] = data['Run'].apply(strToSeconds)
data['Overall_s'] = data['Overall'].apply(strToSeconds)
data['T1_s'] = data['T1'].apply(strToSeconds)
data['T2_s'] = data['T2'].apply(strToSeconds)
data.head()

,BIB,Name,Country,Gender,Division,Swim,Bike,Run,Overall,Division Rank,Gender Rank,Overall Rank,T1,T2,Swim_s,Bike_s,Run_s,Overall_s,T1_s,T2_s
0,4,"Frodeno, Jan",DEU,Male,MPRO,00:47:31,04:16:02,02:42:43,07:51:13,1,1,1,00:01:58,00:02:59,2851,15362,9763,28273,118,179
1,6,"O'donnell, Tim",USA,Male,MPRO,00:47:38,04:18:11,02:49:45,07:59:41,2,2,2,00:02:01,00:02:06,2858,15491,10185,28781,121,126
2,5,"Kienle, Sebastian",DEU,Male,MPRO,00:52:17,04:15:04,02:49:56,08:02:04,3,3,3,00:02:12,00:02:35,3137,15304,10196,28924,132,155
3,14,"Hoffman, Ben",USA,Male,MPRO,00:51:01,04:24:01,02:43:08,08:02:52,4,4,4,00:02:25,00:02:17,3061,15841,9788,28972,145,137
4,11,"Wurf, Cameron",AUS,Male,MPRO,00:52:25,04:14:44,02:55:03,08:06:41,5,5,5,00:02:07,00:02:22,3145,15284,10503,29201,127,142

In [33]:
atletas_dns = data.loc[data['Overall Rank'] == 'DNS']
atletas_dns.head()

,BIB,Name,Country,Gender,Division,Swim,Bike,Run,Overall,Division Rank,Gender Rank,Overall Rank,T1,T2,Swim_s,Bike_s,Run_s,Overall_s,T1_s,T2_s
2355,2436,"Lacerda, Carla",BRA,Female,F18-24,NaN,NaN,NaN,NaN,DNS,DNS,DNS,NaN,NaN,nan,nan,nan,nan,nan,nan
2357,2341,"Hoare, Rebecca",GBR,Female,F25-29,NaN,NaN,NaN,NaN,DNS,DNS,DNS,NaN,NaN,nan,nan,nan,nan,nan,nan
2358,2344,"Ireland, Heather",USA,Female,F25-29,NaN,NaN,NaN,NaN,DNS,DNS,DNS,NaN,NaN,nan,nan,nan,nan,nan,nan
2359,2374,"Wade-west, Milly",GBR,Female,F25-29,NaN,NaN,NaN,NaN,DNS,DNS,DNS,NaN,NaN,nan,nan,nan,nan,nan,nan
2360,2188,"Hodges, Maria",PHL,Female,F30-34,NaN,NaN,NaN,NaN,DNS,DNS,DNS,NaN,NaN,nan,nan,nan,nan,nan,nan

In [34]:
atletas_dnf = data.loc[data['Overall Rank'] == 'DNF']
atletas_dnf.head()

,BIB,Name,Country,Gender,Division,Swim,Bike,Run,Overall,Division Rank,Gender Rank,Overall Rank,T1,T2,Swim_s,Bike_s,Run_s,Overall_s,T1_s,T2_s
2258,468,"Weinbrandt, Richard",USA,Male,M75-79,01:29:11,08:35:07,06:54:53,NaN,DNF,DNF,DNF,00:05:47,00:09:22,5351,30907,24893,nan,347,562
2259,556,"Cowles, Karen",USA,Female,F65-69,01:29:07,08:14:16,06:55:17,NaN,DNF,DNF,DNF,00:10:47,00:11:44,5347,29656,24917,nan,647,704
2260,452,"Tarkington, Al",USA,Male,M80-84,01:39:25,07:33:59,07:42:55,NaN,DNF,DNF,DNF,00:08:37,00:12:56,5965,27239,27775,nan,517,776
2261,31,"Stein, Boris",DEU,Male,MPRO,00:54:15,04:13:18,NaN,NaN,DNF,DNF,DNF,00:02:01,00:02:43,3255,15198,nan,nan,121,163
2262,15,"Nilsson, Patrik",SWE,Male,MPRO,00:50:49,04:25:51,NaN,NaN,DNF,DNF,DNF,00:02:11,00:02:25,3049,15951,nan,nan,131,145

In [35]:
atletas_dq = data.loc[data['Overall Rank'] == 'DQ']
atletas_dq.head()

,BIB,Name,Country,Gender,Division,Swim,Bike,Run,Overall,Division Rank,Gender Rank,Overall Rank,T1,T2,Swim_s,Bike_s,Run_s,Overall_s,T1_s,T2_s
2356,2442,"Rena, Kubota",JPN,Female,F18-24,NaN,NaN,NaN,NaN,DQ,DQ,DQ,NaN,NaN,nan,nan,nan,nan,nan,nan
2366,1381,"Pederzoli, Laura",ITA,Female,F45-49,NaN,NaN,NaN,NaN,DQ,DQ,DQ,NaN,NaN,nan,nan,nan,nan,nan,nan
2377,2037,"Entwistle, Michael",AUS,Male,M30-34,NaN,NaN,NaN,NaN,DQ,DQ,DQ,NaN,NaN,nan,nan,nan,nan,nan,nan
2401,362,"Nagy, Denes",USA,Male,M40-44,NaN,NaN,NaN,NaN,DQ,DQ,DQ,NaN,NaN,nan,nan,nan,nan,nan,nan
2418,236,"Zhen, Deng Guo",CHN,Male,M50-54,NaN,NaN,NaN,NaN,DQ,DQ,DQ,NaN,NaN,nan,nan,nan,nan,nan,nan

In [36]:
print('Atletas que não iniciaram a prova: '+str(atletas_dns.shape[0]))
print('Atletas que não finalizaram a prova: '+str(atletas_dnf.shape[0]))
print('Atletas desqualificados: '+str(atletas_dq.shape[0]))

Atletas que não iniciaram a prova: 73
Atletas que não finalizaram a prova: 98
Atletas desqualificados: 5

In [22]:
data.shape
data = data.drop(data[data['Overall Rank'] == 'DNF'].index)
print(data.shape)
data = data.drop(data[data['Overall Rank'] == 'DNS'].index)
print(data.shape)
data = data.drop(data[data['Overall Rank'] == 'DQ'].index)
print(data.shape)

(2263, 14)
(2263, 14)
(2258, 14)

In [23]:
data.describe

<bound method NDFrame.describe of       BIB                    Name Country  Gender Division  Swim   Bike  \
0       4            Frodeno, Jan     DEU    Male     MPRO  2851  15362
1       6          O'donnell, Tim     USA    Male     MPRO  2858  15491
2       5       Kienle, Sebastian     DEU    Male     MPRO  3137  15304
3      14            Hoffman, Ben     USA    Male     MPRO  3061  15841
4      11           Wurf, Cameron     AUS    Male     MPRO  3145  15284
...   ...                     ...     ...     ...      ...   ...    ...
2253  555          Beavers, Cathy     USA  Female   F65-69  6330  30301
2254  502        Whitehouse, Paul     USA    Male   M70-74  7561  28280
2255  250  Svoboda-vasquez, Hanna     DEU  Female   F50-54  5373  29787
2256  535     Piasentini, Edgardo     ARG    Male   M65-69  6147  27729
2257  370            Yotov, Kamen     BGR    Male   M40-44  5550  28644

        Run Overall Division Rank Gender Rank Overall Rank   T1   T2
0      9763   28273             1           1            1  118  179
1     10185   28781             2           2            2  121  126
2     10196   28924             3           3            3  132  155
3      9788   28972             4           4            4  145  137
4     10503   29201             5           5            5  127  142
...     ...     ...           ...         ...          ...  ...  ...
2253  22732   60603            26         609         2262  625  615
2254  23374   60604            28        1654         2263  709  680
2255  24462   60663            66         610         2264  587  454
2256  26029   60801            50        1655         2265  377  519
2257  25422   61029           274        1656         2266  805  608

[2258 rows x 14 columns]>

In [24]:
data.head()

,BIB,Name,Country,Gender,Division,Swim,Bike,Run,Overall,Division Rank,Gender Rank,Overall Rank,T1,T2
0,4,"Frodeno, Jan",DEU,Male,MPRO,2851,15362,9763,28273,1,1,1,118,179
1,6,"O'donnell, Tim",USA,Male,MPRO,2858,15491,10185,28781,2,2,2,121,126
2,5,"Kienle, Sebastian",DEU,Male,MPRO,3137,15304,10196,28924,3,3,3,132,155
3,14,"Hoffman, Ben",USA,Male,MPRO,3061,15841,9788,28972,4,4,4,145,137
4,11,"Wurf, Cameron",AUS,Male,MPRO,3145,15284,10503,29201,5,5,5,127,142